Белгипрозем_2017/src/Enums/мВариантыКарточекИсходныхДанных/мВариантыКарточекИсходныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мВариантыКарточекИсходныхДанных</name>
  <comment>Варианты карточек исходных данных для составления договоров</comment>
  <enumValues>
    <name>КарточкаИзготовлениеПлана</name>
  </enumValues>
  <enumValues>
    <name>КарточкаОтвода_Площадной</name>
  </enumValues>
  <enumValues>
    <name>КарточкаОтвода_Линейный</name>
  </enumValues>
  <enumValues>
    <name>КарточкаОтвода_Площадно_Линейный</name>
  </enumValues>
  <enumValues>
    <name>КарточкаОтвода_Линейно_Площадный</name>
  </enumValues>
  <enumValues>
    <name>КарточкаПИР_Площадной</name>
  </enumValues>
  <enumValues>
    <name>КарточкаПИР_Линейный</name>
  </enumValues>
  <enumValues>
    <name>КарточкаПИР_Площадно_Линейный</name>
  </enumValues>
  <enumValues>
    <name>КарточкаПИР_Линейно_Площадный</name>
  </enumValues>
  <enumValues>
    <name>КарточкаСоставленияОстаточногоКаталога</name>
  </enumValues>
  <enumValues>
    <name>КарточкаУстановленияГраниц</name>
  </enumValues>
  <enumValues>
    <name>КарточкаУстановленияНефиксированныхГраниц</name>
  </enumValues>
  <enumValues>
    <name>КарточкаФормированияУчастков</name>
  </enumValues>
  <enumValues>
    <name>КарточкаУниверсальная</name>
  </enumValues>
  <enumValues>
    <name>КарточкаОценка</name>
  </enumValues>
  <enumValues>
    <name>КарточкаУстановленияНефиксированныхГраницМинэнерго</name>
  </enumValues>
  <enumValues>
    <name>КарточкаГрадостроительныйПаспорт</name>
  </enumValues>
  <enumValues>
    <name>КарточкаИзготовленияКопийМатериалов</name>
  </enumValues>
  <enumValues>
    <name>КарточкаВедениеЭксплуатацияЗИС</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/CommonModules/РаботаСКарточкойОбъекта/Module.bsl
// возвращает имя макета
Функция ПолучитьИмяМакета(ВариантКарточки) Экспорт 
	Если ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОтвода_Линейно_Площадный Тогда
		ИмяМакета = "КарточкаОтвода_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОтвода_Линейный Тогда
		ИмяМакета = "КарточкаОтвода_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОтвода_Площадно_Линейный Тогда
		ИмяМакета = "КарточкаОтвода_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОтвода_Площадной Тогда
		ИмяМакета = "КарточкаОтвода_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаПИР_Линейно_Площадный Тогда
		ИмяМакета = "КарточкаПИР_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаПИР_Линейный Тогда
		ИмяМакета = "КарточкаПИР_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаПИР_Площадно_Линейный Тогда
		ИмяМакета = "КарточкаПИР_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаПИР_Площадной Тогда
		ИмяМакета = "КарточкаПИР_Площадно_Линейный";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаУстановленияГраниц Тогда
		ИмяМакета = "КарточкаУстановленияГраниц";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаУстановленияНефиксированныхГраниц Тогда
		ИмяМакета = "КарточкаУстановленияНефиксированныхГраниц";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаФормированияУчастков Тогда
		ИмяМакета = "КарточкаФормированияУчастков";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаИзготовлениеПлана Тогда
		ИмяМакета = "КарточкаИзготовлениеПлана";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаСоставленияОстаточногоКаталога Тогда
		ИмяМакета = "КарточкаСоставленияОстаточногоКаталога";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаУниверсальная Тогда
		ИмяМакета = "КарточкаУниверсальная";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаОценка Тогда
		ИмяМакета = "КарточкаОценка";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаУстановленияНефиксированныхГраницМинэнерго Тогда
		ИмяМакета = "КарточкаУстановленияНефиксированныхГраницМинэнерго";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаГрадостроительныйПаспорт Тогда
		ИмяМакета = "КарточкаГрадостроительныйПаспорт";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаИзготовленияКопийМатериалов Тогда
		ИмяМакета = "КарточкаИзготовленияКопийМатериалов";
	ИначеЕсли ВариантКарточки = Перечисления.мВариантыКарточекИсходныхДанных.КарточкаВедениеЭксплуатацияЗИС Тогда
		ИмяМакета = "КарточкаВедениеЭксплуатацияЗИС";
	Иначе
		ИмяМакета = "";
	КонецЕсли; 
	
	Возврат ИмяМакета;

КонецФункции
